const luxian = {
    title : '学习路线',
    tag:['热门','前端','后端','移动端','计算机基础','大数据','测试','人工智能'],
    demo :[
        [
            {
                h4:'Java从网络编程到高并发学习路线',
                p:'网络编程、并发编程、高并发、消息队列等问题是Java工程师绕不开的痛点，也是大厂岗位明文要求的，本路线一站式攻克以上四大难关',
                span:'4步骤 · 6门课',
                num:'5904人收藏',
                img:require('./img/re1.jpg')
            },
            {
                h4:'Vue.js从入门到全栈开发',
                p:'优秀的前端工程师都要掌握一门后端语言，从vue到node，前后端通吃，提高前端工程师的竞争力。',
                span:'4步骤 · 5门课',
                num:'8947人收藏',
                img:require('./img/re2.jpg')
            },
            {
                h4:'大数据零基础入门求职路线',
                p:'路线面向零基础用户，从入门到实现大数据综合实战，助力大家快速入行转型！',
                span:'5步骤 · 8门课',
                num:'2351人收藏',
                img:require('./img/re3.jpg')
            },
            {
                h4:'计算机基础学习路线',
                p:'本路线精选程序员必修的数学基础课和计算机基础核心知识，有序打基础职场走更远。',
                span:'3步骤 · 4门课',
                num:'2791人收藏',
                img:require('./img/re4.jpg')
            },
            {   

                h4:'Python爬虫工程师养成计划',
                p:'路线从零起步，系统培养爬虫工程师，步步为营打造爬虫工程师的核心竞争力。',
                span:'4步骤 · 6门课',
                num:'9786人收藏',
                img:require('./img/re5.jpg')
            },
            {
                h4:'Java从初级到高级的进阶面试线路图 ',
                p:'路线吃透面试学问，伴随身为Java工程师的你一路成长，高效充分准备面试拿offer。',
                span:'3步骤 · 4门课',
                num:'5671人收藏',
                img:require('./img/re6.jpg')
            }
        ],
        [
            {
                h4:'微信小程序从0基础到精通',
                p:'一站式掌握小程序生态，打造站内零基础精通小程序的最佳路径',
                span:'4步骤 · 6门课',
                num:'5903人收藏',
                img:require('./img/qd1.png')
            },
            {
                h4:'前端面试求职跳槽通关路线',
                p:'路线伴随Web前端工程师一路成长，彻底搞懂不同阶段的面试重点，高效拿下offer。',
                span:'4步骤 · 5门课',
                num:'20817人收藏',
                img:require('./img/qd2.jpg')
            },
            {
                h4:'Node.js 零基础从入门到玩转 ',
                p:'本路线从Node.js基础到热门框架应用，从理解到实战一步到位。',
                span:'4步骤 · 6门课',
                num:'8843人收藏',
                img:require('./img/qd3.png')
            },
            {
                h4:'Vue.js从入门到全栈开发',
                p:'优秀的前端工程师都要掌握一门后端语言，从vue到node，前后端通吃，提高前端工程师的竞争力。',
                span:'4步骤 · 6门课',
                num:'3571人收藏',
                img:require('./img/re2.jpg')
            },
            {
                h4:'Vue.js 从入门到精通',
                p:'路线专为想学Vue却无从下手的人群设计，以实际项目为例，逐层深入，学透Vue。',
                span:'4步骤 · 6门课',
                num:'11374人收藏',
                img:require('./img/qd5.jpg')
            },
            {
                h4:'React.js 框架从零到全栈开发',
                p:'从React.js基础入手，学习全栈技能，上手全栈项目，路线清晰，不走弯路。',
                span:'4步骤 · 6门课',
                num:'18165人收藏',
                img:require('./img/qd6.jpg')
            }
        ],
        [   
            {   
                h4:'从零开始  一站搞定Python Django开发 ',
                p:'路线专为零Django基础学员定制，层层深入，助你熟练掌握Django应用技能。',
                span:'3步骤 · 4门课',
                num:'2357人收藏',
                img:require('./img/hd1.png')
            },
            {
                h4:'Python高薪工程师精进路线',
                p:'专为Pythoner进阶高薪定制，从高级语法到主流框架再到源码，系统提升高薪技能。',
                span:'4步骤 · 6门课',
                num:'5903人收藏',
                img:require('./img/hd2.png')
            },
            {
                h4:'Java从初级到高级的进阶面试线路图',
                p:'路线吃透面试学问，伴随身为Java工程师的你一路成长，高效充分准备面试拿offer。',
                span:'5步骤 · 6门课',
                num:'9786人收藏',
                img:require('./img/hd3.jpg')
            },
            {
                h4:'SpringCloud全面进阶之路 ',
                p:'运用SpringCloud完成企业级项目微服务改造，不断提升，掌握几大特色模块和主流技术组合',
                span:'3步骤 · 4门课',
                num:'5671人收藏',
                img:require('./img/hd4.jpg')
            },
            {
                h4:'Go语言从入门到达人之路',
                p:'零基础入门Go语言，在掌握基础语法后向并发提升，并用Go去构建微服务。',
                span:'4步骤 · 6门课',
                num:'3909人收藏',
                img:require('./img/hd5.jpg')
            },
            {
                h4:'SpringBoot从入门到精通',
                p:'本路线旨在帮助想快速掌握SpringBoot应用的工程师，全方位多角度带你升级。',
                span:'4步骤 · 5门课',
                num:'10162人收藏',
                img:require('./img/hd6.jpg')
            }
        ],
        [
            {
                h4:'Android工程师高薪面试突破路线',
                p:'路线汇集Android高级工程师面试的关键技能，还原面试官视角，助力面试顺利通关。',
                span:'3步骤 · 3门课',
                num:'1165人收藏',
                img:require('./img/yd1.jpg')
            },
            {
                h4:'流媒体（音视频）开发高手学习路线',
                p:'对标大厂岗位需求，从音视频处理核心技术到服务器设计开发 ，全面培养高手。',
                span:'3步骤 · 3门课',
                num:'1289人收藏',
                img:require('./img/yd2.jpg')
            },
            {
                h4:'Android架构师核心技能学习路线',
                p:'Android架构师必备技能的精选学习路线，软硬实力双向提升，进阶必选。',
                span:'4步骤 · 4门课',
                num:'2931人收藏',
                img:require('./img/yd3.jpg')
            },
            {
                h4:'移动端进阶高级工程师成长路线',
                p:'精准对标移动端高级工程师的岗位要求，技能步步拔高，是移动端工程师进阶高工不二之选。',
                span:'3步骤 · 4门课',
                num:'5470人收藏',
                img:require('./img/yd4.jpg')
            }
        ],
        [
            {
                h4:'计算机基础学习路线',
                p:'本路线精选程序员必修的数学基础课和计算机基础核心知识，有序打基础职场走更远。',
                span:'4步骤 · 6门课',
                num:'7840人收藏',
                img:require('./img/jsj1.jpg')
            },
            {
                h4:'从零开始系统掌握算法',
                p:'路线从原理到实操，落脚算法项目的真实场景。搞定算法，搞定晋升，搞定大厂。',
                span:'3步骤 · 3门课',
                num:'5352人收藏',
                img:require('./img/jsj2.jpg')
            }
        ],
        [
            {
                h4:'大数据零基础入门求职路线',
                p:'路线面向零基础用户，从入门到实现大数据综合实战，助力大家快速入行转型！',
                span:'5步骤 · 8门课',
                num:'2684人收藏',
                img:require('./img/daj1.jpg')
            },
            {
                h4:'大数据容器化实践从入门到进阶',
                p:'本路线以开发者的视角逐层深入，从语言基础开始，到最终完成企业级应用容器化部署。',
                span:'3步骤 · 4门课',
                num:'3076人收藏',
                img:require('./img/daj2.jpg')
            }
        ],
        [
            {
                h4:'Java功能测试转型自动化测试之路',
                p:'专为想要转型的Java功能测试人群设计，系统吃透自动化测试的知识点。',
                span:'4步骤 · 4门课',
                num:'1600人收藏',
                img:require('./img/cs1.jpg')
            },
            {
                h4:'从功能测试到自动化测试转型路线',
                p:'自动化测试效率更高，路线旨在帮Python功能测试从业者成功转型。',
                span:'4步骤 · 5门课',
                num:'10718人收藏',
                img:require('./img/cs2.jpg')
            }
        ],
        [
            {
                h4:'从0入门人工智能学习',
                p:'路线面向0基础用户，从最基础的开发语言Python学起，带你进入人工智能的世界。',
                span:'5步骤 · 5门课',
                num:'13559人收藏',
                img:require('./img/rgzn.jpg')
            }
        ]
    ]
}

export default luxian